app/controllers/students_controller.rb

	def create
	  @student = Student.new(post_params(:title, :description))
	  @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-11-05 19:39:28.805232"], ["updated_at", "2018-11-05 19:39:28.805232"]]